using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace ChessApp.Model
{
    /// <summary>
    /// 扑克牌类
    /// </summary>
    public class Card
    {
        public int number;
        public int[] card;
        public string type;
        //public enum Color
        //{
        //    红桃=1,
        //    方片=2,
        //    草花=3,
        //    黑桃=4,

        //}
        public enum Type
        {
            单张 = 1,
            一对子 = 2,
            双王 = 39,
            三对子 = 14,
            四对子 = 15,
            五对子 = 16,
            六对子 = 17,
            七对子 = 18,
            八对子 = 19,
            九对子 = 20,
            十对子 = 21,
            三带 = 3,
            三带一 = 4,
            三带二 = 13,
            六带 = 22,
            六带二 = 23,
            六带四 = 24,
            九带 = 25,
            九带三 = 26,
            九带六 = 27,
            十二带 = 30,
            十二带四 = 31,
            十二带八 = 32,
            十五带 = 33,
            十五带五 = 34,
            十八带 = 35,
            五连 = 5,
            六连 = 6,
            七连 = 7,
            八连 = 8,
            九连 = 9,
            十连 = 10,
            十一连 = 11,
            十二连 = 12,
            炸弹 = 36,
            炸弹带二 = 37,
            炸弹带四 = 38
            ///
            /// 牌类型锁对应的牌的数量
            ///
            ////单张=1,
            //  一对子=2,                 
            //  双王=2,
            //  三带=3,需要排序
            //  三带一=4,需要排序
            //  炸弹=4,
            //  五连=5,需要排序
            //  三带二=5,需要排序
            //  三对子 = 6,需要排序
            //  六带=6,需要排序
            //  六连=6,需要排序
            //  炸弹带二=6,需要排序
            //  七连=7,需要排序
            //  四队子 = 8,需要排序
            //  六带二=8,需要排序
            //  八连=8,需要排序
            //  炸弹带四=8需要排序
            //  九带=9,需要排序
            //  九连=9,需要排序
            //  五对子=10,需要排序
            //  六带四=10,需要排序
            //  十连=10,需要排序
            //  十一连=11,需要排序
            //  六对子=12,需要排序
            //  九带三=12,需要排序
            //  十二连=12,需要排序
            //  十二带=12,需要排序
            //  七对子=14,需要排序
            //  九带六=15,
            //  十五带=15,
            //  十二带四=16,
            //  八对子=16,
            //  十八带=18，没写
            //  九对子=18,
            //  十对子=20,  
            //  十二带八=20,    没写 
            //  十五带五=20,  没写

        }
        // 3 4 5 6 7 8 9 10 11--J 12--Q 13--K  14--A 15--2 16--小王  17--大王
        public void CardCreat(int[] data)
        {
            this.card = new int[data.Length];
            Array.Copy(this.card, data, data.Length);
        }

    }
}
